Documents/ЗаявкаНаКомпенсациюСпортаИМедицины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаявкаНаКомпенсациюСпортаИМедицины</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокНаКомпенсацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеПремии</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПремииОфиснымРаботникам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденТилНет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЧек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоговора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компенсация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыЗаявокНаКомпенсацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокНаКомпенсацию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Медицина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаКомпенсациюСпортаИМедицины/Forms/ФормаСписка/Ext/Form/Module.bsl
//+++АК ILIK 2018.07.19 ИП-00019130
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава")
	   И Не УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.АкцептантЗаявкиДляМедицины, Ложь) Тогда
		Если Документы.ЗаявкаНаКомпенсациюСпортаИМедицины.ЭтоРуководительПодразделения() Тогда
			Акцептант = ПараметрыСеанса.ТекущийПользователь;
			Элементы.ОтборАкцептант.ТолькоПросмотр = Истина;
		ИначеЕсли УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.СогласующийТилНет, Ложь) Тогда
			ВидЗаявки = Перечисления.ВидыЗаявокНаКомпенсацию.Медицина;
			Элементы.ОтборВидЗаявки.ТолькоПросмотр = Истина;
		Иначе
			Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Элементы.ОтборОтветственный.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтборы();
КонецПроцедуры

//+++АК ILIK 2018.07.19 ИП-00019130
&НаСервере
Процедура УстановитьОтборы()
	Список.Параметры.УстановитьЗначениеПараметра("Акцептант", Акцептант);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", Ответственный);
	Список.Параметры.УстановитьЗначениеПараметра("ВидЗаявки", ВидЗаявки);
КонецПроцедуры

//+++АК ILIK 2018.07.19 ИП-00019130
&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры

//+++АК ILIK 2018.07.19 ИП-00019130
&НаКлиенте
Процедура ОтборВидЗаявкиПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры

//+++АК ILIK 2018.07.19 ИП-00019130
&НаКлиенте
Процедура ОтборАкцептантПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры

//+++АК ILIK 2018.07.19 ИП-00019130
&НаКлиенте
Процедура ОтборАкцептантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("Ссылка", ПолучитьСписокРуководителей()));
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыОткрытия, Элемент);
КонецПроцедуры

//+++АК ILIK 2018.07.19 ИП-00019130
&НаСервереБезКонтекста
Функция ПолучитьСписокРуководителей()
	Возврат Документы.ЗаявкаНаКомпенсациюСпортаИМедицины.ПолучитьСписокРуководителей();
Конецфункции
